;;; doom/packages.el

;; -- Note Taking --
(package! denote)
(package! consult-denote)

;; -- Visuals --
;; (package! org-modern)
(package! org-appear)
(package! mixed-pitch)
(package! olivetti)
(package! org-superstar)
(package! mixed-pitch)
;; -- Languages --
(package! templ-ts-mode)

;; -- Elfeed --
(package! elfeed-tube)
;;(package! elfeed-tube-mpv) ; Optional: if you have mpv installed
